Revit 2026 API

# SubRegionFailures Properties

---

The BuiltInFailuresSubRegionFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CreateSubRegionFailed | Create sub-division failed. |
|  | NoHostForToposolidSubregion | This sub-division now does not appear to overlap any Toposolid with an appropriate Phase and Design Option. |
|  | SubDivisionOffsetInvalid | Sub-division's offset must be less than the thickness of its type. |
|  | SubDivisionPhaseMismatch | Sub-division must have the same Phase Created parameter and Phase Demolished parameter as the host Toposolid. Sub-division phase will be set to match the Toposolid. |

#### Reference

BuiltInFailuresSubRegionFailures Class

Autodesk.Revit.DB Namespace